api-management/apis/calculator__1[Current]/operations/POST___soapAction=http___tE566M8.request.application_soap+xml.html

<?xml version="1.0" encoding="utf-8"?>
<Envelope xmlns="http://www.w3.org/2003/05/soap-envelope">
  <Body>
    <Multiply xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://tempuri.org/">
      <intA>10</intA>
      <intB>3</intB>
    </Multiply>
  </Body>
</Envelope>