src/main/resources/templates/multiply-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
       <tem:Multiply>
         <tem:intA>${headers.salario}</tem:intA>
         <tem:intB>20</tem:intB>
      </tem:Multiply>
   </soapenv:Body>
</soapenv:Envelope>